{
  "source": "t.me/FurrySunfest",
  "fetchedAt": "2026-02-25T18:19:08.346111+00:00",
  "translatedBy": "Codex (manual, unicode-fixed)",
  "messages": [
    {
      "id": 31,
      "date": "2026-01-11T19:21:36+00:00",
      "text": "We have everything ready to start room reservations for Moonfest 2026. ✨\n\n👋 Official Date Change 👋\n\nFor hotel logistics reasons, the event dates have been adjusted. Please save the official date:\n\nFrom July 10 to July 13, 2026. 🗓️\n\nStage 1: Room Reservations\n\nNow that the date is confirmed and the link is enabled, we are entering the first stage of our schedule.\n\nIt is mandatory to reserve your room in order to attend the event. ⚠️\n\nOn the website you will find an FAQ section with essential information to answer your questions.\n\n👇 Make your reservation here! 👇\n\nhttps://moonfest-b63fa.web.app/\n\n⚠️ Important note: The website is still under development. Since you are the first wave using it, you may see changes or adjustments in the future. Thank you for being part of this process!",
      "media": []
    },
    {
      "id": 30,
      "date": "2026-01-11T05:05:46+00:00",
      "text": "We are so back 😎\n\nWe are here to let you know the issue with the hotel has been resolved and we can continue with this very important phase.\n\nOn Sunday, January 11, 2026 at 2:00 PM (GMT-5), we will publish the link to proceed with room reservations. Remember we have rooms for up to 4 people and some for 2 people.\n\nRemember it is important to have or be part of a room in order to attend the event, and ticket payment will be made through a separate announcement.",
      "media": [
        {
          "type": "MessageMediaPhoto",
          "path": "telegram/media/msg_30.jpg",
          "name": null,
          "mime": "image/jpeg",
          "size": 117754
        }
      ]
    },
    {
      "id": 29,
      "date": "2026-01-10T00:46:18+00:00",
      "text": "Emergency announcement 😰\n\nWe need to inform you that we must postpone publishing the link.\n\nDuring our verification tests before publication, we noticed the hotel's link stopped working correctly, so we will need to wait for the hotel to respond about what happened. 🔥\n\nAs soon as we have a response and a solution to this issue, we will let you know.\n\nWe are sorry for the inconvenience 😟",
      "media": []
    },
    {
      "id": 28,
      "date": "2026-01-09T21:30:33+00:00",
      "text": "👋 Welcome to Moonfest ✨\n\nLet me introduce myself, I am Jecht Howl and I will be your host during the event. It is a pleasure to have you here.\n\nI am here to tell you that today, Friday, January 9, 2026, at 8:00 PM (GMT-5), you will be able to start reserving your rooms. We currently have 60 rooms available for up to 4 people (not restrictive), meaning if you want a room for yourself or your partner, you can also reserve.\n\nYou can also find more information and answers to frequently asked questions on our website.\n\nSo I will see you at 8:00 to take your reservations, and please keep order in the queue.\n\nRemember this is only for room reservations; event entry will be handled through another link.\n\n#FursuitFriday #Moonfest2026 #FurryColombia",
      "media": [
        {
          "type": "MessageMediaPhoto",
          "path": "telegram/media/msg_28.jpg",
          "name": null,
          "mime": "image/jpeg",
          "size": 120858
        }
      ]
    },
    {
      "id": 27,
      "date": "2025-12-24T01:18:46+00:00",
      "text": "Hello everyone,\n\nWe know we already made one date-change announcement, and unfortunately we have to make another. The hotel informed us that the July 24-27 dates are not available either. We deeply regret these inconveniences, which were entirely caused by the hotel's internal organization issues.\n\nThe final dates for Moonfest 2026 are July 10-13, 2026.\n\nThe great news is that, after all these issues, we finally have the room reservation link ready!\n\nAs promised, people who attended the Furry Colombia Halloween party will have a small advantage over everyone else. We will release the link to them 24 hours earlier so they can make their reservation.\n\nWe wish you happy holidays and greatly appreciate your patience and understanding. Sorry for all the delays caused by this situation, and thank you for staying with us.\n\nIf you have any questions, we are at your disposal.\n\nMoonfest Team 🌙",
      "media": []
    },
    {
      "id": 26,
      "date": "2025-12-16T17:08:30+00:00",
      "text": "Important announcement about Furry Moonfest 2026\n\nHello everyone,\n\nWe want to inform you that, due to circumstances beyond our control, we need to reschedule Moonfest.\n\nThe new dates are July 24-27, 2026, which is one week earlier than previously scheduled.\n\nWe understand this change may cause inconvenience and we sincerely apologize. At this moment we are working on updating all links and corresponding information. Thank you for your patience while we complete this process.\n\nWe greatly value your understanding and support. We remain committed to offering you the best possible experience, and we are confident these new dates will allow us to deliver the event we all expect.\nIf you have any questions, we are at your disposal.\n\nThank you for your understanding.\n\n- Moonfest Team 🌙",
      "media": []
    },
    {
      "id": 25,
      "date": "2025-12-07T23:05:30+00:00",
      "text": "Chia and Moka have something incredible ready for you! We can now begin the first official step toward Moonfest, and we want to share it with all the excitement in the universe because this is already starting.\n\nHotel reservations are now available, and this week we will share the special links provided for that purpose. Only one person per group should make the reservation for everyone. And remember what the hotel emphasized: MAXIMUM FOUR PEOPLE PER ROOM, although there are also options for those who prefer to stay alone, as a couple, or in groups of three without any issue. Best of all, the charge is not made immediately. It is processed 48 hours before the event, so you can reserve calmly and keep saving.\n\nAfter reserving, the group fills out a very simple form with the reservation number provided by the hotel. That step is completed only once per group and will help us organize everything.\n\nOfficial Moonfest registration will arrive in 2026, and only those associated with a group with a valid reservation code will be able to register. Unlike the hotel, event registration is paid immediately at the time of signup.\n\nFor now, celebrate. We have begun. The Moonfest adventure is underway, and what is coming will be unforgettable. If you have questions, we are here with full energy and ready to help.\n\n🌙✨",
      "media": []
    },
    {
      "id": 24,
      "date": "2025-12-06T23:19:01+00:00",
      "text": "I'll just say... this is a good time to stay tuned 👀\n\n🌙",
      "media": []
    },
    {
      "id": 23,
      "date": "2025-11-09T11:34:59+00:00",
      "text": "Sunfest is evolving, and this year it arrives with a new name: Moonfest.\n\nAfter two editions under the sun, we are moving to the cold weather of Paipa. We are looking for a different, calm, and welcoming energy, with hot springs, mountains, and nights under the moon.\n\nRegistration is also changing and will now be in two stages:\n\n1. Hotel reservation\n\nReservations will be made through official hotel links that will be provided soon.\n\nIf you are going in a group (maximum 4 per room) or as a couple, only one person reserves, and when registering for the convention, each person indicates which reservation they are under.\n\n❗ Hotel reservation payment will not be charged until 48 hours before the event.\n\n2. Convention registration\n\nRegistration will be through the Conspace platform at the beginning of 2026. Only those who already have a room will be able to register.\n\nIncludes:\n• Round-trip transportation from Bogota.\n• Access to common areas such as the heated pool and thermal-water jacuzzi.\n• Official event merch.\n\nFor more info, join the channel:\nt.me/FurrySunfest",
      "media": [
        {
          "type": "MessageMediaPhoto",
          "path": "telegram/media/msg_23.jpg",
          "name": null,
          "mime": "image/jpeg",
          "size": 58381
        }
      ]
    },
    {
      "id": 22,
      "date": "2025-11-09T00:00:02+00:00",
      "text": "Furry Moonfest is coming!\n\nThis time we will meet at the Estelar Paipa Convention Center hotel between July 31 and August 3, 2026.\n\nMore news coming soon! 🌙",
      "media": []
    }
  ]
}
